Revit 2027 API
ParameterTypeId.AnalyticalMemberOffsetStartX Property
 "Start Offset X"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalMemberOffsetStartX { get; }
Public Shared ReadOnly Property AnalyticalMemberOffsetStartX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalMemberOffsetStartX {
	ForgeTypeId^ get ();
}
static member AnalyticalMemberOffsetStartX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace